package com.javarush.test.level01.lesson06.task01;
public class Solution
{
    public static void main(String[] args)
    {
        System.out.println("Меня зовут Амиго.\n" +
		        "\n" +
		        "Я согласен на зарплату $800/месяц в первый год.\n" +
		        "Я согласен на зарплату $1500/месяц во второй год.\n" +
		        "Я согласен на зарплату $2200/месяц в третий год.\n" +
		        "Я согласен на зарплату $2700/месяц в четвертый год.\n" +
		        "Я согласен на зарплату $3200/месяц в пятый год.\n" +
		        "\n" +
		        "Поцелуй мой блестящий металлический зад!");

    }
}